Revit 2027 API
DockablePane(DockablePaneId) Constructor
 Gets the pane with identifier %id%.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DockablePane(
	DockablePaneId id
)
Public Sub New (
	id As DockablePaneId
)
public:
DockablePane(
	DockablePaneId^ id
)
new :
        id : DockablePaneId -> DockablePane
Parameters
id DockablePaneId
Exceptions
Exception | Condition
ArgumentException |  no dockable pane has been registered with identifier id. -or- the dockable pane with identifier id has not been created yet.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DockablePane Class
DockablePane Overload
Autodesk.Revit.UI Namespace